CHN-HYH/esp32-26-h/esp32Board_wifi/main/src/app_myhttpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "app_myhttpd.hpp"

#include <list>
#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_jpeg_enc.h"
#include "lwip/sockets.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "app_mymdns.h"
#include "sdkconfig.h"

#include "yahboom_camera.h"
#include "yahboom_performance.h"
#include "esp_timer.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define TAG ""
#else
#include "esp_log.h"
static const char *TAG = "camera_httpd";
#endif

static QueueHandle_t xQueueFrameI = NULL;
static QueueHandle_t xQueueFrameO = NULL;
static bool gReturnFB = true;

static int8_t detection_enabled = 0;
static int8_t recognition_enabled = 0;
static int8_t is_enrolling = 0;

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
#define STREAM_JPEG_QUALITY 60
#define STREAM_JPEG_CONGESTED_QUALITY 40
#define STREAM_JPEG_CONGESTION_US 100000
#define STREAM_JPEG_QUALITY_RECOVERY_FRAMES 12
#define STREAM_JPEG_BUFFER_SIZE (128 * 1024)
#define STREAM_PREVIEW_WIDTH 320
#define STREAM_PREVIEW_HEIGHT 240
#define STREAM_PREVIEW_BUFFER_SIZE (STREAM_PREVIEW_WIDTH * STREAM_PREVIEW_HEIGHT * 2)
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %lld.%06lld\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;
httpd_handle_t webserver = NULL;

typedef struct
{
    jpeg_enc_handle_t handle;
    uint8_t *output;
    uint8_t *preview;
    uint8_t quality;
    uint8_t stable_frames;
} stream_jpeg_encoder_t;

static bool stream_jpeg_encoder_init(stream_jpeg_encoder_t *encoder)
{
    jpeg_enc_config_t config = DEFAULT_JPEG_ENC_CONFIG();
    config.width = STREAM_PREVIEW_WIDTH;
    config.height = STREAM_PREVIEW_HEIGHT;
    config.src_type = JPEG_PIXEL_FORMAT_YCbYCr;
    config.subsampling = JPEG_SUBSAMPLE_420;
    config.quality = STREAM_JPEG_QUALITY;
    config.rotate = JPEG_ROTATE_0D;
    config.task_enable = false;

    encoder->handle = NULL;
    encoder->quality = STREAM_JPEG_QUALITY;
    encoder->stable_frames = 0;
    encoder->preview = static_cast<uint8_t *>(heap_caps_aligned_alloc(
        16, STREAM_PREVIEW_BUFFER_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
    encoder->output = static_cast<uint8_t *>(
        heap_caps_malloc(STREAM_JPEG_BUFFER_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
    if (!encoder->preview || !encoder->output)
    {
        ESP_LOGE(TAG, "Fast JPEG preview buffer allocation failed");
        heap_caps_free(encoder->preview);
        heap_caps_free(encoder->output);
        encoder->preview = NULL;
        encoder->output = NULL;
        return false;
    }

    jpeg_error_t ret = jpeg_enc_open(&config, &encoder->handle);
    if (ret != JPEG_ERR_OK)
    {
        ESP_LOGE(TAG, "Fast JPEG encoder initialization failed: %d", ret);
        heap_caps_free(encoder->preview);
        heap_caps_free(encoder->output);
        encoder->preview = NULL;
        encoder->output = NULL;
        return false;
    }

    ESP_LOGI(TAG, "Fast JPEG encoder ready: %dx%d color preview, quality %d",
             STREAM_PREVIEW_WIDTH, STREAM_PREVIEW_HEIGHT, STREAM_JPEG_QUALITY);
    return true;
}

static void stream_jpeg_encoder_deinit(stream_jpeg_encoder_t *encoder)
{
    if (encoder->handle)
    {
        jpeg_enc_close(encoder->handle);
        encoder->handle = NULL;
    }
    heap_caps_free(encoder->preview);
    heap_caps_free(encoder->output);
    encoder->preview = NULL;
    encoder->output = NULL;
}

// 本地识别保留 QVGA；网页预览按比例最近邻缩放，优先保留亮度边缘。
static bool stream_downsample_yuv422(const camera_fb_t *frame, uint8_t *preview)
{
    if (!frame || !preview || frame->format != PIXFORMAT_YUV422 ||
        frame->width != 320 || frame->height != 240 ||
        frame->len < (size_t)frame->width * frame->height * 2)
    {
        return false;
    }

    const size_t source_stride = frame->width * 2;
    const size_t preview_stride = STREAM_PREVIEW_WIDTH * 2;
    for (size_t y = 0; y < STREAM_PREVIEW_HEIGHT; ++y)
    {
        const size_t source_y = y * frame->height / STREAM_PREVIEW_HEIGHT;
        const uint8_t *source_row = frame->buf + source_y * source_stride;
        uint8_t *destination = preview + y * preview_stride;

        for (size_t pair = 0; pair < STREAM_PREVIEW_WIDTH / 2; ++pair)
        {
            const size_t output_x0 = pair * 2;
            const size_t output_x1 = output_x0 + 1;
            const size_t source_x0 = output_x0 * frame->width / STREAM_PREVIEW_WIDTH;
            const size_t source_x1 = output_x1 * frame->width / STREAM_PREVIEW_WIDTH;
            const uint8_t *source_pair0 = source_row + (source_x0 & ~1U) * 2;
            const uint8_t *source_pair1 = source_row + (source_x1 & ~1U) * 2;
            uint8_t *output_pair = destination + pair * 4;

            output_pair[0] = source_row[source_x0 * 2];
            output_pair[1] = (uint8_t)((source_pair0[1] + source_pair1[1]) / 2);
            output_pair[2] = source_row[source_x1 * 2];
            output_pair[3] = (uint8_t)((source_pair0[3] + source_pair1[3]) / 2);
        }
    }

    return true;
}

static bool stream_jpeg_encode(stream_jpeg_encoder_t *encoder, const camera_fb_t *frame,
                               uint8_t **jpg_buf, size_t *jpg_len)
{
    if (!encoder->handle || !encoder->output || !encoder->preview ||
        !stream_downsample_yuv422(frame, encoder->preview))
    {
        return false;
    }

    int encoded_size = 0;
    jpeg_error_t ret = jpeg_enc_process(encoder->handle, encoder->preview,
                                        STREAM_PREVIEW_BUFFER_SIZE,
                                        encoder->output, STREAM_JPEG_BUFFER_SIZE,
                                        &encoded_size);
    if (ret != JPEG_ERR_OK || encoded_size <= 0)
    {
        ESP_LOGE(TAG, "Fast JPEG compression failed: %d", ret);
        return false;
    }

    *jpg_buf = encoder->output;
    *jpg_len = static_cast<size_t>(encoded_size);
    return true;
}

static void stream_jpeg_adjust_quality(stream_jpeg_encoder_t *encoder, uint32_t send_us)
{
    uint8_t next_quality = encoder->quality;
    if (send_us > STREAM_JPEG_CONGESTION_US)
    {
        encoder->stable_frames = 0;
        if (next_quality > STREAM_JPEG_CONGESTED_QUALITY)
            next_quality = STREAM_JPEG_CONGESTED_QUALITY;
    }
    else if (next_quality < STREAM_JPEG_QUALITY)
    {
        encoder->stable_frames++;
        if (encoder->stable_frames >= STREAM_JPEG_QUALITY_RECOVERY_FRAMES)
        {
            next_quality += 5;
            if (next_quality > STREAM_JPEG_QUALITY)
                next_quality = STREAM_JPEG_QUALITY;
            encoder->stable_frames = 0;
        }
    }

