CHN-HYH/esp32-26-h/esp32Board_wifi/main/src/app_myhttpd.cpp
    if (next_quality == encoder->quality)
        return;

    if (jpeg_enc_set_quality(encoder->handle, next_quality) == JPEG_ERR_OK)
    {
        encoder->quality = next_quality;
        ESP_LOGI(TAG, "Preview JPEG quality adjusted to %u", (unsigned)next_quality);
    }
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

static esp_err_t capture_handler(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    esp_err_t res = ESP_OK;

    if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
    {
        httpd_resp_set_type(req, "image/jpeg");
        httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
        httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

        char ts[32];
        snprintf(ts, 32, "%lld.%06ld", frame->timestamp.tv_sec, frame->timestamp.tv_usec);
        httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

        // size_t fb_len = 0;
        if (frame->format == PIXFORMAT_JPEG)
        {
                // fb_len = frame->len;
            res = httpd_resp_send(req, (const char *)frame->buf, frame->len);
        }
        else
        {
            jpg_chunking_t jchunk = {req, 0};
            res = frame2jpg_cb(frame, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
            httpd_resp_send_chunk(req, NULL, 0);
            // fb_len = jchunk.len;
        }

        if (xQueueFrameO)
        {
            xQueueSend(xQueueFrameO, &frame, portMAX_DELAY);
        }
        else if (gReturnFB)
        {
            esp_camera_fb_return(frame);
        }
        else
        {
            free(frame);
        }
    }
    else
    {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    return res;
}

static esp_err_t stream_handler(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    struct timeval _timestamp;
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;
    char part_buf[128];
    stream_jpeg_encoder_t encoder = {};
    bool fast_encoder_ready = stream_jpeg_encoder_init(&encoder);
    const int tcp_nodelay = 1;

    if (setsockopt(httpd_req_to_sockfd(req), IPPROTO_TCP, TCP_NODELAY,
                   &tcp_nodelay, sizeof(tcp_nodelay)) < 0)
    {
        ESP_LOGW(TAG, "Failed to enable TCP_NODELAY for stream");
    }

    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK)
    {
        stream_jpeg_encoder_deinit(&encoder);
        return res;
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    while (true)
    {
        bool jpg_buf_allocated = false;
        bool fallback_encoder_used = false;
        const int64_t queue_wait_start_us = esp_timer_get_time();

        if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
        {
            const uint32_t queue_wait_us =
                static_cast<uint32_t>(esp_timer_get_time() - queue_wait_start_us);
            _timestamp.tv_sec = frame->timestamp.tv_sec;
            _timestamp.tv_usec = frame->timestamp.tv_usec;
            const int64_t encode_start_us = esp_timer_get_time();

            if (frame->format == PIXFORMAT_JPEG)
            {
                _jpg_buf = frame->buf;
                _jpg_buf_len = frame->len;
            }
            else if (fast_encoder_ready && stream_jpeg_encode(&encoder, frame, &_jpg_buf, &_jpg_buf_len))
            {
            }
            else if (!frame2jpg(frame, STREAM_JPEG_QUALITY, &_jpg_buf, &_jpg_buf_len))
            {
                fallback_encoder_used = true;
                ESP_LOGE(TAG, "JPEG compression failed");
                res = ESP_FAIL;
            }
            else
            {
                fallback_encoder_used = true;
                jpg_buf_allocated = true;
            }
            const uint32_t encode_us =
                static_cast<uint32_t>(esp_timer_get_time() - encode_start_us);
            const size_t encoded_jpeg_size = _jpg_buf_len;

            // YUV/RGB 帧已编码到独立 JPEG 缓冲，可在网络发送前归还摄像头帧。
            if (res == ESP_OK && xQueueFrameO == NULL && gReturnFB && frame->format != PIXFORMAT_JPEG)
            {
                esp_camera_fb_return(frame);
                frame = NULL;
            }
            const int64_t send_start_us = esp_timer_get_time();
            if (res == ESP_OK)
                res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));

            if (res == ESP_OK)
            {
                size_t hlen = snprintf(part_buf, sizeof(part_buf), _STREAM_PART, _jpg_buf_len,
                                       (long long)_timestamp.tv_sec, (long long)_timestamp.tv_usec);
                res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
            }

            if (res == ESP_OK)
                res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);

            const uint32_t send_us =
                static_cast<uint32_t>(esp_timer_get_time() - send_start_us);
            yahboom_performance_record_stream(queue_wait_us, encode_us, send_us,
                                               encoded_jpeg_size, fallback_encoder_used);
            if (fast_encoder_ready)
                stream_jpeg_adjust_quality(&encoder, send_us);
        }
        else
        {
            res = ESP_FAIL;
        }

        if (jpg_buf_allocated)
        {
            free(_jpg_buf);
        }
        _jpg_buf = NULL;
        _jpg_buf_len = 0;

        if (frame)
        {
            if (xQueueFrameO)
            {
                xQueueSend(xQueueFrameO, &frame, portMAX_DELAY);
            }
            else if (gReturnFB)
            {
                esp_camera_fb_return(frame);
            }
            else
            {
                free(frame);
            }
        }

        if (res != ESP_OK)
        {
            break;
        }
    }

    stream_jpeg_encoder_deinit(&encoder);

    return res;
}

static esp_err_t parse_get(httpd_req_t *req, char **obuf)
{
    char *buf = NULL;
    size_t buf_len = 0;

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1)
    {
        buf = (char *)malloc(buf_len);
        if (!buf)
        {
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK)
        {
            *obuf = buf;
            return ESP_OK;
        }
        free(buf);
    }
    httpd_resp_send_404(req);
    return ESP_FAIL;
}

static esp_err_t cmd_handler(httpd_req_t *req)
{
    char *buf = NULL;
    char variable[32];
    char value[32];

    if (parse_get(req, &buf) != ESP_OK ||
        httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK ||
        httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK)
    {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }
    free(buf);

